<a href="https://colab.research.google.com/github/Andrewzekid/MCExcelAPI/blob/main/ExcelAPI.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [4]:
import numpy as np
import pandas as pd
import math
import datetime
from openpyxl import Workbook

In [5]:
def clean_names(origional_name):
  #removes any unwanted whitespace from a name
  # " Juri Mikoshiba " turns into "Juri Mikoshiba"

  split_on_whitespace = origional_name.split(" ")
  for i in split_on_whitespace:
    i = i.replace("\t","")
    i = i.replace("\n","")

  name = [i for i in split_on_whitespace if i != ""]
  cleaned_name = " ".join(name)

  return cleaned_name

In [49]:
def clean_df(df):
  df["Name"] = df.apply(lambda x: clean_names(x["Name"]),axis=1)
  df["Score"] = df.apply(lambda x: clean_scores(x["Score"]),axis=1)
  df["Class"] = df.apply(lambda x: clean_names(x["Class"]),axis=1)

  return df

In [50]:
clean_df(df3)

NameError: ignored

In [51]:
clean_names("Arita Mana")

'Arita Mana'

In [52]:
clean_names("Arita Mana Angelina")

'Arita Mana Angelina'

In [53]:

def clean_scores(origional_score):
  #removes any unwanted whitespace from a score
  if type(origional_score) == str:
    #if the score is a string
    #process a string (I.e: turn a score from " 750 " into 750)
    origional_score = int(origional_score)

  return origional_score

In [54]:
def clean_grade_string(string):
  #code to clean the strings for grade values i.e: " 8A " becomes "G8A"

  #code to replace extra whitespaces
  string = string.replace(" ","")
  if "G" not in string:
    string = "G" + string
  return string

In [55]:
SCORES_LIST = [750,500,250,100,100,100,100,100,100,100,100,100]
#define the global variable "Scores List"

In [56]:
from openpyxl import load_workbook

In [57]:
from openpyxl.utils import get_column_letter

In [58]:
def read_excel_file(path,rowstart,rowend,colstart,colend):
  """
  read(path,rowstart,rowend,colstart,colend)

  Description: 
  Prints out the values from every cell within the rowstart,rowend,colstart,colend parameters, from a workbook that can be found via path.

  Parameters:
    Path(str):
      path to the workbook
    
    rowstart,rowend(int):
      indicate what rows to read from
    
    colstart,colend(int): 
      indicate what columns to read from

  """
  wb = load_workbook(path)
  ws = wb.active
  for row in range(rowstart,rowend):
    for column in range(colstart,colend):
      col = get_column_letter(column)
      print(ws["{}{}".format(col,row)].value)
    print("=====================================")
  df = pd.read_excel(path)
  return wb,df

In [59]:
wb,df = read_excel_file("Math Commitee Data (3).xlsx",1,11,1,4)

Name
Class
Score
=====================================
Juri Mikoshiba
G6A
	3000
=====================================
Manato Tanaka
G6B
3000
=====================================
Tyler Glanville
G6A
1350
=====================================
Divyansh Gupta
G8A
1100
=====================================
Shoukei Hada
G6A
250
=====================================
Ota Horii
G6A
	200
=====================================
Yuvraj Jadia
G6B
100
=====================================
Arita Mana Angelina
G6B
100
=====================================
Shi Xintong
G8B
	100
=====================================

In [60]:
df

                  Name Class  Score
0       Juri Mikoshiba   G6A   3000
1        Manato Tanaka   G6B   3000
2      Tyler Glanville   G6A   1350
3       Divyansh Gupta   G8A   1100
4         Shoukei Hada   G6A    250
5            Ota Horii   G6A    200
6         Yuvraj Jadia   G6B    100
7  Arita Mana Angelina   G6B    100
8          Shi Xintong   G8B    100
9         Zhang Tongxi   G7A    100

In [69]:
wb1,df1 = read_excel_file("Math Commitee Week 6(1-5).xlsx",1,4,1,20)

ID
Start time
Completion time
Email
Name
Total points
Quiz feedback
Name (Please type your name)
Points - Name (Please type your name)
Feedback - Name (Please type your name)
Homeroom
Points - Homeroom
Feedback - Homeroom
Your answer
Points - Your answer
Feedback - Your answer
(Optional) Your Working in text - It may be featured in the Daily Notices as the solution of the week!
Points - (Optional) Your Working in text - It may be featured in the Daily Notices as the solution of the week!
Feedback - (Optional) Your Working in text - It may be featured in the Daily Notices as the solution of the week!
=====================================
1
2021-11-27 18:01:46.999998
2021-11-27 18:06:55.999999
anonymous
None
None
None
Manato Tanaka
None
None
G6B
None
None
11
None
None
It says its optional but it's required so I'm writing this so I can submit.
None
None
=====================================
2
2021-11-27 18:13:15.000001
2021-11-27 18:14:10.999997
anonymous
None
None
None
Manato Tanaka
None
None
G6B
None
None
11
None
None
I think I already submited it but I can submit again, so I sumbit again just in case.
None
None
=====================================

In [71]:
df1

   ID  ... Feedback - (Optional) Your Working in text - It may be featured in the Daily Notices as the solution of the week!
0   1  ...                                                NaN
1   2  ...                                                NaN
2   3  ...                                                NaN
3   4  ...                                                NaN
4   5  ...                                                NaN

[5 rows x 19 columns]

In [62]:
df1

   ID  ... Feedback - (Optional) Your Working in text - It may be featured in the Daily Notices as the solution of the week!
0   1  ...                                                NaN
1   2  ...                                                NaN
2   3  ...                                                NaN
3   4  ...                                                NaN
4   5  ...                                                NaN

[5 rows x 19 columns]

In [63]:
def process_results_file(path):
  wb1,df1 = read_excel_file(path,1,10,1,20)
  df1 = df1.dropna(axis=1)
  df1 = df1.drop(["Email","Start time","ID","(Optional) Your Working in text - It may be featured in the Daily Notices as the solution of the week!"],axis=1)
  df1 = df1.drop_duplicates(subset="Name (Please type your name)",keep="last")
  return df1

In [73]:
def check_answers_and_assign_scores(df,answer,booster=1):
  correct_df_1 = df[df["Your answer"] == answer]

  #rename the "Name" column of the dataframe containing the info about the people who got the correct answers
  correct_df = correct_df_1.rename({"Name (Please type your name)":"Name","Homeroom":"Class"},axis=1)

  #main code to assign the scores
  correct_df["Completion time"] = pd.to_datetime(correct_df["Completion time"])
  correct_df = correct_df.sort_values("Completion time")
  scores_to_be_used = SCORES_LIST[0:len(correct_df)] * booster
  correct_df["Score"] = scores_to_be_used
  #as we no longer need the completion time and the answer columns anymore, drop them
  correct_df = correct_df.drop(["Completion time","Your answer"],axis=1)
  correct_df = correct_df.reset_index()
  correct_df = correct_df.drop("index",axis=1)
  print(correct_df)
  return correct_df

In [65]:
def check_and_remove_descrepancies(df,df2):
  indexes = list(df["Name"])
  indexes_new = list(df2["Name"])
  df = df.set_index("Name")
  df2 = df2.set_index("Name")
  print(indexes)
  print(indexes_new)
  print(df)
  print(df2)
  for i in range(len(indexes_new)):
    #loop through the newly answered questions
    if indexes_new[i] in indexes:
      #the same person has answered another question
      df.loc[indexes_new[i],"Score"] = df.loc[indexes_new[i],"Score"] + df2.loc[indexes_new[i],"Score"]
    else:
      
      #a new person has answered
      print(df2.loc[indexes_new[i]])
      df = df.append(df2.loc[indexes_new[i]],ignore_index=False)
  df = df.sort_values("Score",ascending=False)
  return df

In [72]:
process_results_file("Math Commitee Week 6(1-5).xlsx")

ID
Start time
Completion time
Email
Name
Total points
Quiz feedback
Name (Please type your name)
Points - Name (Please type your name)
Feedback - Name (Please type your name)
Homeroom
Points - Homeroom
Feedback - Homeroom
Your answer
Points - Your answer
Feedback - Your answer
(Optional) Your Working in text - It may be featured in the Daily Notices as the solution of the week!
Points - (Optional) Your Working in text - It may be featured in the Daily Notices as the solution of the week!
Feedback - (Optional) Your Working in text - It may be featured in the Daily Notices as the solution of the week!
=====================================
1
2021-11-27 18:01:46.999998
2021-11-27 18:06:55.999999
anonymous
None
None
None
Manato Tanaka
None
None
G6B
None
None
11
None
None
It says its optional but it's required so I'm writing this so I can submit.
None
None
=====================================
2
2021-11-27 18:13:15.000001
2021-11-27 18:14:10.999997
anonymous
None
None
None
Manato Tanaka
None
None
G6B
None
None
11
None
None
I think I already submited it but I can submit again, so I sumbit again just in case.
None
None
=====================================
3
2021-11-28 19:32:16.999996
2021-11-28 20:08:50.000001
anonymous
None
None
None
Juri Mikoshiba
None
None
G6A
None
None
11
None
None
First, change the required formula by making the denominator ab. Then we know that the required formula can also be a^2-bc-c^2/ab. As we know that ab=2, this formula can be further expanded. So it would be 4(a+c)-bc/2. a+b+c equals to 6, so (a+c) can be 6-b. So the formula would be expanded into 24-4b-bc/2. Summarizing until now, a+c=6-b, a=4+c, b(4+c)=2, 4b+4c=2, bc=2-4b. 24-4b-2+4b/2=22/2=11. The answer is 11.
None
None
=====================================
4
2021-11-28 21:54:50
2021-11-28 21:55:46.999998
anonymous
None
None
None
Divyansh Gupta
None
None
G8A
None
None
11
None
None
Um, I don't have any.
None
None
=====================================
5
2021-11-29 11:35:47.999996
2021-11-29 11:36:18.000003
anonymous
None
None
None
Aryan Sokhiya
None
None
G9B
None
None
11
None
None
LOL
None
None
=====================================
None
None
None
None
None
None
None
None
None
None
None
None
None
None
None
None
None
None
None
=====================================
None
None
None
None
None
None
None
None
None
None
None
None
None
None
None
None
None
None
None
=====================================
None
None
None
None
None
None
None
None
None
None
None
None
None
None
None
None
None
None
None
=====================================

      Completion time Name (Please type your name) Homeroom  Your answer
1 2021-11-27 18:14:11                Manato Tanaka      G6B           11
2 2021-11-28 20:08:50               Juri Mikoshiba      G6A           11
3 2021-11-28 21:55:47               Divyansh Gupta      G8A           11
4 2021-11-29 11:36:18               Aryan Sokhiya       G9B           11

In [74]:
def update_leaderboard(path_to_leaderboard,path_to_new_data,answer,booster=1):
  wb,df1 = read_excel_file(path_to_leaderboard,1,11,1,4)
  df1 = clean_df(df1)
  # df1 = clean_df(df1)
  
  #after we have processed the leaderboard dataframe, process the dataframe containing the new submissions
  df3 = process_results_file(path_to_new_data)
  df3 = check_answers_and_assign_scores(df3,answer=answer,booster=booster)
  df3 = clean_df(df3)
  print(df3)

  final_df = check_and_remove_descrepancies(df1,df3)
  #it is now done!!1
  return final_df

In [75]:
final_df = update_leaderboard("Math Commitee Data (3).xlsx","Math Commitee Week 6(1-5).xlsx",answer=11)

Name
Class
Score
=====================================
Juri Mikoshiba
G6A
	3000
=====================================
Manato Tanaka
G6B
3000
=====================================
Tyler Glanville
G6A
1350
=====================================
Divyansh Gupta
G8A
1100
=====================================
Shoukei Hada
G6A
250
=====================================
Ota Horii
G6A
	200
=====================================
Yuvraj Jadia
G6B
100
=====================================
Arita Mana Angelina
G6B
100
=====================================
Shi Xintong
G8B
	100
=====================================
ID
Start time
Completion time
Email
Name
Total points
Quiz feedback
Name (Please type your name)
Points - Name (Please type your name)
Feedback - Name (Please type your name)
Homeroom
Points - Homeroom
Feedback - Homeroom
Your answer
Points - Your answer
Feedback - Your answer
(Optional) Your Working in text - It may be featured in the Daily Notices as the solution of the week!
Points - (Optional) Your Working in text - It may be featured in the Daily Notices as the solution of the week!
Feedback - (Optional) Your Working in text - It may be featured in the Daily Notices as the solution of the week!
=====================================
1
2021-11-27 18:01:46.999998
2021-11-27 18:06:55.999999
anonymous
None
None
None
Manato Tanaka
None
None
G6B
None
None
11
None
None
It says its optional but it's required so I'm writing this so I can submit.
None
None
=====================================
2
2021-11-27 18:13:15.000001
2021-11-27 18:14:10.999997
anonymous
None
None
None
Manato Tanaka
None
None
G6B
None
None
11
None
None
I think I already submited it but I can submit again, so I sumbit again just in case.
None
None
=====================================
3
2021-11-28 19:32:16.999996
2021-11-28 20:08:50.000001
anonymous
None
None
None
Juri Mikoshiba
None
None
G6A
None
None
11
None
None
First, change the required formula by making the denominator ab. Then we know that the required formula can also be a^2-bc-c^2/ab. As we know that ab=2, this formula can be further expanded. So it would be 4(a+c)-bc/2. a+b+c equals to 6, so (a+c) can be 6-b. So the formula would be expanded into 24-4b-bc/2. Summarizing until now, a+c=6-b, a=4+c, b(4+c)=2, 4b+4c=2, bc=2-4b. 24-4b-2+4b/2=22/2=11. The answer is 11.
None
None
=====================================
4
2021-11-28 21:54:50
2021-11-28 21:55:46.999998
anonymous
None
None
None
Divyansh Gupta
None
None
G8A
None
None
11
None
None
Um, I don't have any.
None
None
=====================================
5
2021-11-29 11:35:47.999996
2021-11-29 11:36:18.000003
anonymous
None
None
None
Aryan Sokhiya
None
None
G9B
None
None
11
None
None
LOL
None
None
=====================================
None
None
None
None
None
None
None
None
None
None
None
None
None
None
None
None
None
None
None
=====================================
None
None
None
None
None
None
None
None
None
None
None
None
None
None
None
None
None
None
None
=====================================
None
None
None
None
None
None
None
None
None
None
None
None
None
None
None
None
None
None
None
=====================================
             Name Class  Score
0   Manato Tanaka   G6B    750
1  Juri Mikoshiba   G6A    500
2  Divyansh Gupta   G8A    250
3  Aryan Sokhiya    G9B    100
             Name Class  Score
0   Manato Tanaka   G6B    750
1  Juri Mikoshiba   G6A    500
2  Divyansh Gupta   G8A    250
3   Aryan Sokhiya   G9B    100
['Juri Mikoshiba', 'Manato Tanaka', 'Tyler Glanville', 'Divyansh Gupta', 'Shoukei Hada', 'Ota Horii', 'Yuvraj Jadia', 'Arita Mana Angelina', 'Shi Xintong', 'Zhang Tongxi']
['Manato Tanaka', 'Juri Mikoshiba', 'Divyansh Gupta', 'Aryan Sokhiya']
                    Class  Score
Name
Juri Mikoshiba        G6A   3000
Manato Tanaka         G6B   3000
Tyler Glanville       G6A   1350
Divyansh Gupta        G8A   1100
Shoukei Hada          G6A    250
Ota Horii             G6A    200
Yuvraj Jadia          G6B    100
Arita Mana Angelina   G6B    100
Shi Xintong           G8B    100
Zhang Tongxi          G7A    100
               Class  Score
Name
Manato Tanaka    G6B    750
Juri Mikoshiba   G6A    500
Divyansh Gupta   G8A    250
Aryan Sokhiya    G9B    100
Class    G9B
Score    100
Name: Aryan Sokhiya, dtype: object

In [76]:
final_df

                    Class  Score
Name
Manato Tanaka         G6B   3750
Juri Mikoshiba        G6A   3500
Tyler Glanville       G6A   1350
Divyansh Gupta        G8A   1350
Shoukei Hada          G6A    250
Ota Horii             G6A    200
Yuvraj Jadia          G6B    100
Arita Mana Angelina   G6B    100
Shi Xintong           G8B    100
Zhang Tongxi          G7A    100
Aryan Sokhiya         G9B    100

In [29]:
import re

In [30]:
clean_grade_string(" 9A ")
#normally the whitespace in " 9A " would ca

'G9A'

In [31]:
wb,df = read_excel_file("Math Commitee Data (3).xlsx",1,11,1,4)

Name
Class
Score
=====================================
Juri Mikoshiba
G6A
	3000
=====================================
Manato Tanaka
G6B
3000
=====================================
Tyler Glanville
G6A
1350
=====================================
Divyansh Gupta
G8A
1100
=====================================
Shoukei Hada
G6A
250
=====================================
Ota Horii
G6A
	200
=====================================
Yuvraj Jadia
G6B
100
=====================================
Arita Mana Angelina
G6B
100
=====================================
Shi Xintong
G8B
	100
=====================================

In [32]:
df2 = process_results_file("Math Commitee Week 6(1-5).xlsx")

ID
Start time
Completion time
Email
Name
Total points
Quiz feedback
Name (Please type your name)
Points - Name (Please type your name)
Feedback - Name (Please type your name)
Homeroom
Points - Homeroom
Feedback - Homeroom
Your answer
Points - Your answer
Feedback - Your answer
(Optional) Your Working in text - It may be featured in the Daily Notices as the solution of the week!
Points - (Optional) Your Working in text - It may be featured in the Daily Notices as the solution of the week!
Feedback - (Optional) Your Working in text - It may be featured in the Daily Notices as the solution of the week!
=====================================
1
2021-11-27 18:01:46.999998
2021-11-27 18:06:55.999999
anonymous
None
None
None
Manato Tanaka
None
None
G6B
None
None
11
None
None
It says its optional but it's required so I'm writing this so I can submit.
None
None
=====================================
2
2021-11-27 18:13:15.000001
2021-11-27 18:14:10.999997
anonymous
None
None
None
Manato Tanaka
None
None
G6B
None
None
11
None
None
I think I already submited it but I can submit again, so I sumbit again just in case.
None
None
=====================================
3
2021-11-28 19:32:16.999996
2021-11-28 20:08:50.000001
anonymous
None
None
None
Juri Mikoshiba
None
None
G6A
None
None
11
None
None
First, change the required formula by making the denominator ab. Then we know that the required formula can also be a^2-bc-c^2/ab. As we know that ab=2, this formula can be further expanded. So it would be 4(a+c)-bc/2. a+b+c equals to 6, so (a+c) can be 6-b. So the formula would be expanded into 24-4b-bc/2. Summarizing until now, a+c=6-b, a=4+c, b(4+c)=2, 4b+4c=2, bc=2-4b. 24-4b-2+4b/2=22/2=11. The answer is 11.
None
None
=====================================
4
2021-11-28 21:54:50
2021-11-28 21:55:46.999998
anonymous
None
None
None
Divyansh Gupta
None
None
G8A
None
None
11
None
None
Um, I don't have any.
None
None
=====================================
5
2021-11-29 11:35:47.999996
2021-11-29 11:36:18.000003
anonymous
None
None
None
Aryan Sokhiya
None
None
G9B
None
None
11
None
None
LOL
None
None
=====================================
None
None
None
None
None
None
None
None
None
None
None
None
None
None
None
None
None
None
None
=====================================
None
None
None
None
None
None
None
None
None
None
None
None
None
None
None
None
None
None
None
=====================================
None
None
None
None
None
None
None
None
None
None
None
None
None
None
None
None
None
None
None
=====================================

In [33]:
df2

      Completion time Name (Please type your name) Homeroom  Your answer
1 2021-11-27 18:14:11                Manato Tanaka      G6B           11
2 2021-11-28 20:08:50               Juri Mikoshiba      G6A           11
3 2021-11-28 21:55:47               Divyansh Gupta      G8A           11
4 2021-11-29 11:36:18               Aryan Sokhiya       G9B           11

In [34]:
def check_answers_and_assign_scores(df,answer,booster=1):
  correct_df_1 = df[df["Your answer"] == answer]

  #rename the "Name" column of the dataframe containing the info about the people who got the correct answers
  correct_df = correct_df_1.rename({"Name (Please type your name)":"Name","Homeroom":"Class"},axis=1)

  #main code to assign the scores
  correct_df["Completion time"] = pd.to_datetime(correct_df["Completion time"])
  correct_df = correct_df.sort_values("Completion time")
  scores_to_be_used = SCORES_LIST[0:len(correct_df)] * booster
  correct_df["Score"] = scores_to_be_used
  #as we no longer need the completion time and the answer columns anymore, drop them
  correct_df = correct_df.drop(["Completion time","Your answer"],axis=1)
  correct_df = correct_df.reset_index()
  correct_df = correct_df.drop("index",axis=1)
  print(correct_df)
  return correct_df

In [35]:
def modify_score(path,value,name,cellstr=None,df=None):
  """
  Docstring:
  modify one value in the excel spreadsheet and save it

  Parameters:
    Path:
      Path to the excel file that you want to modify
    
    cellstr:
      Index of the cell
    
    Value: 
      Value that you want to replace with
    
    name:
      Name of person that has thier score being modified


  """
  wb = load_workbook(path)
  if cellstr != None:
    wb[cellstr].value = value
    print("Modified Value of Cell {} to: {}".format(cellstr,value))
    wb.save("Math Commitee Data modified.xlsx")
  else:
    #we do not know the precise location of the cell to be edited, so thus we will edit the dataframe and save that instead.
    if df == None:
      #no df provided, trigger error
      raise ValueError("Please provide a valid dataframe, or provide a cellstring")
    else:
      #edit the dataframe
      df.loc[name,"Score"] = value
      print("{}'s score has been changed to {}!".format(name,value))
      return df

In [36]:
grade_student_pairs = {"Juri Mikoshiba":"G6A","Manato Tanaka":"G6B","Tyler Glanville":"G6A","Shoukei Hada":"G6A","Ota Horii":"G6B","Divyansh Gupta":"G8A","Yuvraj Jadia":"G6B","Arita Mana Angelina":"G6B","Shi Xintong":"G8B","Zhang Tongxi":"G7A"}

In [40]:
wb,df1 = read_excel_file("Math Commitee Data (3).xlsx",1,4,1,12)

Name
Class
Score
None
None
None
None
None
None
None
None
=====================================
Juri Mikoshiba
G6A
	3000
None
None
None
None
None
None
None
None
=====================================
Manato Tanaka
G6B
3000
None
None
None
None
None
None
None
None
=====================================

In [41]:
df1

                  Name Class  Score
0       Juri Mikoshiba   G6A   3000
1        Manato Tanaka   G6B   3000
2      Tyler Glanville   G6A   1350
3       Divyansh Gupta   G8A   1100
4         Shoukei Hada   G6A    250
5            Ota Horii   G6A    200
6         Yuvraj Jadia   G6B    100
7  Arita Mana Angelina   G6B    100
8          Shi Xintong   G8B    100
9         Zhang Tongxi   G7A    100

In [ ]:
df3

NameError: ignored

In [ ]:
df4 = df3.set_index("Name")

NameError: ignored

In [ ]:
df4.index

Index(['Manato Tanaka', 'Juri Mikoshiba', 'Divyansh Gupta', 'Aryan Sokhiya '], dtype='object', name='Name')

In [ ]:
df4.append(df4.loc["Aryan Sokhiya "],ignore_index=False)

               Class  Score
Name
Manato Tanaka    G6B    750
Juri Mikoshiba   G6A    500
Divyansh Gupta   G8A    250
Aryan Sokhiya    G9B    100
Aryan Sokhiya    G9B    100

In [ ]:
df = check_and_remove_descrepancies(df1,df3)

['Juri Mikoshiba', 'Manato Tanaka', 'Tyler Glanville', 'Divyansh Gupta', 'Shoukei Hada', 'Ota Horii', 'Yuvraj Jadia', 'Arita Mana Angelina', 'Shi Xintong', 'Zhang Tongxi']
['Manato Tanaka', 'Juri Mikoshiba', 'Divyansh Gupta', 'Aryan Sokhiya ']
                    Class  Score
Name
Juri Mikoshiba        G6A   3000
Manato Tanaka         G6B   3000
Tyler Glanville       G6A   1350
Divyansh Gupta        G8A   1100
Shoukei Hada          G6A    250
Ota Horii             G6A    200
Yuvraj Jadia          G6B    100
Arita Mana Angelina   G6B    100
Shi Xintong           G8B    100
Zhang Tongxi          G7A    100
               Class  Score
Name
Manato Tanaka    G6B    750
Juri Mikoshiba   G6A    500
Divyansh Gupta   G8A    250
Aryan Sokhiya    G9B    100
Class    G9B
Score    100
Name: Aryan Sokhiya , dtype: object

In [ ]:
df

                    Class  Score
Name
Manato Tanaka         G6B   3750
Juri Mikoshiba        G6A   3500
Tyler Glanville       G6A   1350
Divyansh Gupta        G8A   1350
Shoukei Hada          G6A    250
Ota Horii             G6A    200
Yuvraj Jadia          G6B    100
Arita Mana Angelina   G6B    100
Shi Xintong           G8B    100
Zhang Tongxi          G7A    100
Aryan Sokhiya         G9B    100

In [ ]:
print(df1,df3)

                  Name Class  Score
0       Juri Mikoshiba   G6A   3000
1       Manato Tanaka    G6B   3000
2      Tyler Glanville   G6A   1350
3       Divyansh Gupta   G8A   1100
4         Shoukei Hada   G6A    250
5            Ota Horii   G6A    200
6         Yuvraj Jadia   G6B    100
7  Arita Mana Angelina   G6B    100
8          Shi Xintong   G8B    100
9         Zhang Tongxi   G7A    100              Name Homeroom  Score
0   Manato Tanaka      G6B    750
1  Juri Mikoshiba      G6A    500

In [ ]:
df1

                  Name Class  Score
0       Juri Mikoshiba   G6A   3000
1       Manato Tanaka    G6B   3000
2      Tyler Glanville   G6A   1350
3       Divyansh Gupta   G8A   1100
4         Shoukei Hada   G6A    250
5            Ota Horii   G6A    200
6         Yuvraj Jadia   G6B    100
7  Arita Mana Angelina   G6B    100
8          Shi Xintong   G8B    100
9         Zhang Tongxi   G7A    100

In [ ]:
df3

             Name Homeroom  Score
0   Manato Tanaka      G6B    750
1  Juri Mikoshiba      G6A    500

In [ ]:
df1.loc[len(df1) + 1] = {"Andrew":[1,3]}

   Class   Score         Name
0    G6A  6000.0          NaN
1    G6B  6000.0          NaN
2    G6A  2700.0          NaN
3    G8A  2200.0          NaN
4    G6A   500.0          NaN
5    G6A   400.0          NaN
6    G6B   200.0          NaN
7    G6B   200.0          NaN
8    G8B   200.0          NaN
9    G7A   200.0          NaN
10   NaN    50.0          NaN
11   NaN     NaN          NaN
12   G9B  1500.0  Andrew Wang

In [ ]:
df3 = pd.DataFrame({"Name":["Andrew Wang"],"Class":["G9B"],"Score":[1500]})

In [ ]:
df3.set_index("Name")

            Class  Score
Name
Andrew Wang   G9B   1500

In [ ]:
pd.concat([df1,df3])

                    Class   Score         Name
Juri Mikoshiba        G6A  6000.0          NaN
Manato Tanaka         G6B  6000.0          NaN
Tyler Glanville       G6A  2700.0          NaN
Divyansh Gupta        G8A  2200.0          NaN
Shoukei Hada          G6A   500.0          NaN
Ota Horii             G6A   400.0          NaN
Yuvraj Jadia          G6B   200.0          NaN
Arita Mana Angelina   G6B   200.0          NaN
Shi Xintong           G8B   200.0          NaN
Zhang Tongxi          G7A   200.0          NaN
11                    NaN    50.0          NaN
12                    NaN     NaN          NaN
0                     G9B  1500.0  Andrew Wang

In [ ]:
df1

                    Class   Score
Name
Juri Mikoshiba        G6A  6000.0
Manato Tanaka         G6B  6000.0
Tyler Glanville       G6A  2700.0
Divyansh Gupta        G8A  2200.0
Shoukei Hada          G6A   500.0
Ota Horii             G6A   400.0
Yuvraj Jadia          G6B   200.0
Arita Mana Angelina   G6B   200.0
Shi Xintong           G8B   200.0
Zhang Tongxi          G7A   200.0
11                    NaN    50.0
12                    NaN     NaN

In [ ]:
df1

                    Class   Score
Name
Juri Mikoshiba        G6A  6000.0
Manato Tanaka         G6B  6000.0
Tyler Glanville       G6A  2700.0
Divyansh Gupta        G8A  2200.0
Shoukei Hada          G6A   500.0
Ota Horii             G6A   400.0
Yuvraj Jadia          G6B   200.0
Arita Mana Angelina   G6B   200.0
Shi Xintong           G8B   200.0
Zhang Tongxi          G7A   200.0
11                    NaN    50.0
12                    NaN     NaN

In [ ]:
test_1,df2 = read_excel_file("Updated scores (1).xlsx",1,4,1,12)

Name
Score
None
None
None
None
None
None
None
None
None
=====================================
Juri Mikoshiba
3000
None
None
None
None
None
None
None
None
None
=====================================
Manato Tanaka
3000
None
None
None
None
None
None
None
None
None
=====================================

In [ ]:
df2 = clean_df(df2)

In [ ]:
df2

                     Score
Name
Juri Mikoshiba        3000
Manato Tanaka         3000
Tyler Glanville       1350
Divyansh Gupta        1100
Shoukei Hada           250
Ota Horii              200
Yuvraj Jadia           100
Arita Mana Angelina    100
Shi Xintong            100
Zhang Tongxi           100
Andrew Wang             50

In [ ]:
df1

                    Class  Score
Name
Juri Mikoshiba        G6A   3000
Manato Tanaka         G6B   3000
Tyler Glanville       G6A   1350
Divyansh Gupta        G8A   1100
Shoukei Hada          G6A    250
Ota Horii             G6A    200
Yuvraj Jadia          G6B    100
Arita Mana Angelina   G6B    100
Shi Xintong           G8B    100
Zhang Tongxi          G7A    100

In [ ]:
df = check_and_remove_descrepancies(df1,df2)

In [ ]:
df

                    Class   Score
Name
Juri Mikoshiba        G6A  6000.0
Manato Tanaka         G6B  6000.0
Tyler Glanville       G6A  2700.0
Divyansh Gupta        G8A  2200.0
Shoukei Hada          G6A   500.0
Ota Horii             G6A   400.0
Yuvraj Jadia          G6B   200.0
Arita Mana Angelina   G6B   200.0
Shi Xintong           G8B   200.0
Zhang Tongxi          G7A   200.0
11                    NaN    50.0

In [ ]:
df2

                    Class  Score
Name
Juri Mikoshiba        G6A   3000
Manato Tanaka         G6B   3000
Tyler Glanville       G6A   1350
Divyansh Gupta        G8A   1100
Shoukei Hada          G6A    250
Ota Horii             G6A    200
Yuvraj Jadia          G6B    100
Arita Mana Angelina   G6B    100
Shi Xintong           G8B    100
Zhang Tongxi          G7A    100

In [ ]:
df1

                    Class  Score
Name
Juri Mikoshiba        G6A   6000
Manato Tanaka         G6B   6000
Tyler Glanville       G6A   2700
Divyansh Gupta        G8A   2200
Shoukei Hada          G6A    500
Ota Horii             G6A    400
Yuvraj Jadia          G6B    200
Arita Mana Angelina   G6B    200
Shi Xintong           G8B    200
Zhang Tongxi          G7A    200

In [ ]:
df

                    Class  Score
Name
Juri Mikoshiba        G6A   6000
Manato Tanaka         G6B   6000
Tyler Glanville       G6A   2700
Divyansh Gupta        G8A   2200
Shoukei Hada          G6A    500
Ota Horii             G6A    400
Yuvraj Jadia          G6B    200
Arita Mana Angelina   G6B    200
Shi Xintong           G8B    200
Zhang Tongxi          G7A    200

In [ ]:
test_1,df2 = read_excel_file("Math Commitee Data (3).xlsx",1,2,1,12)

Name
Class
Score
None
None
None
None
None
None
None
None
=====================================

In [ ]:
df2

In [ ]:
df1

NameError: ignored

In [ ]:
test_1

NameError: ignored

In [ ]:
df.index

Index(['Juri Mikoshiba', 'Manato Tanaka ', 'Tyler Glanville', 'Divyansh Gupta',
       'Shoukei Hada', 'Ota Horii', 'Yuvraj Jadia', 'Arita Mana Angelina',
       'Shi Xintong', 'Zhang Tongxi'],
      dtype='object', name='Name')

In [ ]:
df.index[2] = "Tyler Glanville"

TypeError: ignored

In [ ]:
list(df.index)

['Juri Mikoshiba',
 'Manato Tanaka ',
 'Tyler Glanville',
 'Divyansh Gupta',
 'Shoukei Hada',
 'Ota Horii',
 'Yuvraj Jadia',
 'Arita Mana Angelina',
 'Shi Xintong',
 'Zhang Tongxi']

In [ ]:
indexes = list(df.index)

In [ ]:
for i in range(len(indexes)):
  print(i)
  x = indexes[i].replace("\t","")
  x = x.replace("\n","")
  indexes[i] = x

0
1
2
3
4
5
6
7
8
9
10

In [ ]:
df = df.set_index("Score")
df

Empty DataFrame
Columns: []
Index: [3000, 3000, 1350, 1100, 250, 200, 100, 100, 100, 100, 50]

In [ ]:
df["Name"] = indexes

In [ ]:
df

                      Name
Score
3000        Juri Mikoshiba
3000        Manato Tanaka
1350       Tyler Glanville
1100        Divyansh Gupta
250           Shoukei Hada
200              Ota Horii
100           Yuvraj Jadia
100    Arita Mana Angelina
100            Shi Xintong
100           Zhang Tongxi
50             Andrew Wang

In [ ]:
df.set_index("Name")

Empty DataFrame
Columns: []
Index: [Juri Mikoshiba, Manato Tanaka , Tyler Glanville, Divyansh Gupta, Shoukei Hada, Ota Horii, Yuvraj Jadia, Arita Mana Angelina, Shi Xintong, Zhang Tongxi, Andrew Wang]

In [ ]:
df.Score

Name
Juri Mikoshiba           3000
Manato Tanaka            3000
\tTyler Glanville        1350
\n\t\nDivyansh Gupta     1100
Shoukei Hada              250
\nOta Horii               200
\tYuvraj Jadia            100
\tArita Mana Angelina     100
\tShi Xintong             100
Zhang Tongxi              100
Andrew Wang                50
Name: Score, dtype: int64

In [ ]:
df

                       Score
Name
Juri Mikoshiba          3000
Manato Tanaka           3000
\tTyler Glanville       1350
\n\t\nDivyansh Gupta    1100
Shoukei Hada             250
\nOta Horii              200
\tYuvraj Jadia           100
\tArita Mana Angelina    100
\tShi Xintong            100
Zhang Tongxi             100
Andrew Wang               50

In [ ]:
df1 = df.copy(deep=True)

In [ ]:
df1

                       Score
Name
Juri Mikoshiba          3000
Manato Tanaka           3000
\tTyler Glanville       1350
\n\t\nDivyansh Gupta    1100
Shoukei Hada             250
\nOta Horii              200
\tYuvraj Jadia           100
\tArita Mana Angelina    100
\tShi Xintong            100
Zhang Tongxi             100
Andrew Wang               50

In [ ]:
df1 = clean_df(df1)

0
1
2
3
4
5
6
7
8
9
10
['Juri Mikoshiba', 'Manato Tanaka ', 'Tyler Glanville', 'Divyansh Gupta', 'Shoukei Hada', 'Ota Horii', 'Yuvraj Jadia', 'Arita Mana Angelina', 'Shi Xintong', 'Zhang Tongxi', 'Andrew Wang']
Empty DataFrame
Columns: []
Index: [3000, 3000, 1350, 1100, 250, 200, 100, 100, 100, 100, 50]
                      Name
Score
3000        Juri Mikoshiba
3000        Manato Tanaka
1350       Tyler Glanville
1100        Divyansh Gupta
250           Shoukei Hada
200              Ota Horii
100           Yuvraj Jadia
100    Arita Mana Angelina
100            Shi Xintong
100           Zhang Tongxi
50             Andrew Wang
Empty DataFrame
Columns: []
Index: [Juri Mikoshiba, Manato Tanaka , Tyler Glanville, Divyansh Gupta, Shoukei Hada, Ota Horii, Yuvraj Jadia, Arita Mana Angelina, Shi Xintong, Zhang Tongxi, Andrew Wang]

In [ ]:
df1

                     Score
Name
Juri Mikoshiba        3000
Manato Tanaka         3000
Tyler Glanville       1350
Divyansh Gupta        1100
Shoukei Hada           250
Ota Horii              200
Yuvraj Jadia           100
Arita Mana Angelina    100
Shi Xintong            100
Zhang Tongxi           100
Andrew Wang             50

In [ ]:
indexes

['Juri Mikoshiba',
 'Manato Tanaka ',
 'Tyler Glanville',
 'Divyansh Gupta',
 'Shoukei Hada',
 'Ota Horii',
 'Yuvraj Jadia',
 'Arita Mana Angelina',
 'Shi Xintong',
 'Zhang Tongxi',
 'Andrew Wang']

KeyError: ignored

In [ ]:
df

                       Score
Name
Juri Mikoshiba          3000
Manato Tanaka           3000
\tTyler Glanville       1350
\n\t\nDivyansh Gupta    1100
Shoukei Hada             250
\nOta Horii              200
\tYuvraj Jadia           100
\tArita Mana Angelina    100
\tShi Xintong            100
Zhang Tongxi             100
Andrew Wang               50

TypeError: ignored

In [ ]:
df.inde